[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "rating": {
      "number": 5.0,
      "badge": "Excellent"
    },
    "total_view": "785,688",
    "students": "339,210",
    "title": "Build Modern Responsive Real-World Websites with HTML and CSS",
    "author": {
      "name": "Rakibul Islam",
      "published_date": "2022-10-24 17:27:34",
      "img": "https://i.postimg.cc/CYnrm0Ly/rakib.jpg"
    },
    "thumbnail_url": "https://i.postimg.cc/L6k0sD1m/html-css.png",
    "image_url": "https://i.postimg.cc/L6k0sD1m/html-css.png",
    "details": "The #1 bestselling HTML and CSS course on Rakib Learning! Completely re-built from scratch in July 2021 (35+ hours video) Having gone through other related courses on other platforms, I can say this course is the most practical and readily applicable course on web design and development I have taken. — Bernie Pacis Open a new browser tab, type in www.rakibulinux.com, and take a look around. I will wait here... ... Amazing, right? What if you knew exactly how to design and build a website like that, completely from scratch? How amazing would that be? Well, I'm here to teach you HTML, CSS, and web design, all by building the stunning website that you just saw, step-by-step. So, after finishing this course, you will know exactly how to build a beautiful, professional, and ready-to-launch website just like rakibulinux, by following a 7-step process. And it will even look great on any computer, tablet, and smartphone. But what if you want to build a completely different website? Well, no problem! I designed the course curriculum with exactly this goal: to enable you to design and build any website that you can think of, not just copy the course project. So, in order to become a confident and independent developer, capable of building your own websites in the future, you will learn: The fundamentals of modern and semantic HTML, CSS, and building layouts in a small separate project, which will prepare you for the main course project (www.rakibulinux.com). This includes modern flexbox and CSS Grid! How to design beautiful websites, by learning a web design framework I created just for this course. It consists of easy-to-use guidelines for design aspects like typography, colors, images, spacing, and more (this is like a small standalone course!). How to use well-established website components and layout patterns in order to come up with professional-looking designs How to make any website work on any mobile device, no matter the design and layout (responsive design) How to use the 7 steps of building a professional website in practice: planning, sketching, designing, building, testing, optimizing, and launching How to find and use free design assets such as images, fonts, and icons Important developer skills such as reading documentation, fixing code errors on your own, and using professional web development tools Does this sound like fun? Then join me and 200,000+ other developers and start building websites today! Or are you not sold yet and need to know more? No problem, just keep reading... [01] Why should you learn HTML and CSS in the first place? Building websites allows you to do fun and creative work, from anywhere in the world, and it even pays well. Web development is one of the most future-proof and highest-paying industries in the world. And HTML and CSS is the entry point to this world! But you already know all this, that's why you want to learn HTML and CSS too. Well, you came to the right place! This is the best and most complete course for starting your web development journey that you will find on RakibPL. It's an all-in-one package that takes you from knowing nothing about HTML and CSS, to building beautiful websites using tools and technologies that professional web developers use every single day. [02] Why is this course so unique and popular? Reason #1: The course is completely project-based Simple demos are boring, and therefore you're gonna learn everything by building actual projects! In the final project (www.rakibulinux.com), together we hand-code a beautiful and responsive landing page for a fictional company that I made up just for the course. Reason #2: You will not just learn how to code Coding is great, but it's not everything! That's why we will go through the entire 7-step process of building and launching our website project. So the huge rakibulinux project will teach you real-world skills to build real-world HTML and CSS websites: how to plan projects and page layouts, how to implement designs using HTML and CSS techniques, how to write clean and organized code, how to optimize websites for good speed performance, and many more. On top of that, this course has a huge focus on beautiful design. In fact, this is the only course on the market that focuses on both coding and designing, together. Reason #3: I'm the right teacher for you With the right guidance and a well-structured curriculum, building websites can be quite easy and fun to learn. With a bunch of random tutorials and YouTube videos? Not so much. And that's where I come in. My name is Jonas, I'm an experienced web developer and designer, and one of RakibPL's top instructors. I have been teaching this bestselling course since 2015 to over 200,000 developers, always listening to feedback and understanding exactly how students actually learn. Using that feedback, I recently rebuilt this course from scratch and designed the ideal course curriculum for every type of student. It's a unique blend of projects, deep explanations, theory lectures, and challenges. I'm sure you're gonna love it! [03] Why is this course so long? Reason #1: I take time to explain every single concept that I teach, so that you actually learn, and not just copy code from the screen (this is a course, not a tutorial) Reason #2: I go into topics that other HTML and CSS courses shy away from: professional web design, component and layout patterns, some CSS theory, website planning in theory and practice, and developer skills. I believe you need all of this to be successful! Reason #3: There is a lot of repetition, so that you actually assimilate and practice what you learn. Practice is the single most important ingredient to learning, and therefore I provide plenty of opportunities for you to sharpen your skills [04] Here is what's also included in the package: Up-to-date HD-quality videos, that are easy to search and reference (great for RakibPL Business students) Professional English captions (not the auto-generated ones) Downloadable design assets + starter code and final code for each section Downloadable slides for 20+ theory videos (not boring, I promise!) Access to countless free design and development resources that I curated over many years Free support in the course Q&A 10+ coding challenges to practice your new skills (solutions included) [05] This course is for you if... ... you are a complete beginner with no idea of how to build a website. ... you already know a bit of HTML and CSS from some tutorials or videos, but struggle to put together a good-looking, complete website. ... you are a designer and want to expand your skills into HTML and CSS, because all your designer friends are learning how to code (they are smart!). Basically, if you are an HTML and CSS master, and build the most beautiful websites in the world, then DON'T take the course. Everyone else: you should take the course, today. So, does all of this sound great? Then join me and 200,000+ other developers and start your web development journey today! Who this course is for: Complete beginners who want to learn how to build a professional, beautiful and responsive website Students with some knowledge about HTML and CSS, but who struggle to put together a great website Designers who want to expand their skill set into HTML5 and CSS3"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
    "rating": {
      "number": 5.0,
      "badge": "Excellent"
    },
    "total_view": "785,688",
    "students": "339,210",
    "title": "The Complete JavaScript Course 2022: From Zero to Expert!",
    "author": {
      "name": "Rakibul Islam",
      "published_date": "2022-10-24 17:27:34",
      "img": "https://i.postimg.cc/CYnrm0Ly/rakib.jpg"
    },
    "thumbnail_url": "https://i.postimg.cc/BJGrGLKq/javascript.png",
    "image_url": "https://i.postimg.cc/BJGrGLKq/javascript.png",
    "details": "Why is this the right JavaScript course for you? This is the most complete JavaScript course on Udemy. It's an all-in-one package that will take you from the very fundamentals of JavaScript, all the way to building modern and complex applications. You will learn modern JavaScript from the very beginning, step-by-step. I will guide you through practical and fun code examples, important theory about how JavaScript works behind the scenes, and beautiful and complete projects. You will also learn how to think like a developer, how to plan application features, how to architect your code, how to debug code, and a lot of other real-world skills that you will need on your developer job. And unlike other courses, this one actually contains beginner, intermediate, advanced, and even expert topics, so you don't have to buy any other course in order to master JavaScript from the ground up! But... You don't have to go into all these topics. This is a huge course, because, after all, it's The Complete JavaScript Course. In fact, it's like many courses in one! But you can become an excellent developer by watching only parts of the course. That's why I built this course in a very modular way, and designed pathways that will take you through the course faster. By the end of the course, you will have the knowledge and confidence that you need in order to ace your job interviews and become a professional developer. Why am I the right JavaScript teacher for you? My name is Jonas, I'm an experienced web developer and designer, and one of Udemy's top instructors. I have been teaching this bestselling course since 2016 to over 400,000 developers, always listening to feedback and understanding exactly how students actually learn. Recently, I took all my teaching experience to build this new and greatly improved JavaScript course. It's now the best and most in-depth JavaScript course that you will find on Udemy (and maybe the entire internet). I know how students learn JavaScript and what they need in order to master it. And with that knowledge, I designed the ideal course curriculum. It's a unique blend of real-world projects, deep explanations, theory lectures, and challenges, that will take you from zero to an expert and confident JavaScript developer in just a couple of weeks. So what exactly is covered in the course? Build 5 beautiful real-world projects for your portfolio! In these projects, you will learn how to plan and architect your applications using flowcharts and common JavaScript patterns Master the JavaScript fundamentals: variables, if/else, operators, boolean logic, functions, arrays, objects, loops, strings, and more Learn modern JavaScript (ES6+) from the beginning: arrow functions, destructuring, spread operator, default arguments, optional chaining (ES2020), and more How JavaScript works behind the scenes: engines, the call stack, hoisting, scoping, the 'this' keyword, reference values, and more. Deep dive into functions: arrow functions, first-class and higher-order functions, bind, and closures. Deep dive into object-oriented programming: prototypal inheritance, constructor functions (ES5), classes (ES6), encapsulation, abstraction, inheritance, and polymorphism. [This is like a small standalone course] Deep dive into asynchronous JavaScript: the event loop, promises, async/await, and error handling. You will use these to access data from third-party APIs with AJAX calls. [This is like a small standalone course] Learn modern tools that are used by professional web developers: NPM, Parcel (module bundler), Babel, and ES6 modules Check out the course curriculum for an even more detailed overview of the content :)"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6c",
    "rating": {
      "number": 5.0,
      "badge": "Excellent"
    },
    "total_view": "785,688",
    "students": "339,210",
    "title": "React - The Complete Guide (incl Hooks, React Router, Redux)",
    "author": {
      "name": "Rakibul Islam",
      "published_date": "2022-10-24 17:27:34",
      "img": "https://i.postimg.cc/CYnrm0Ly/rakib.jpg"
    },
    "thumbnail_url": "https://i.postimg.cc/63D181cp/react.jpg",
    "image_url": "https://i.postimg.cc/63D181cp/react.jpg",
    "details": "React.js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web. This course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well. You'll get all the theory, tons of examples and demos, assignments and exercises and tons of important knowledge that is skipped by most other resources - after all, there is a reason why this course is that huge! :) And in case you don't even know why you would want to learn React and you're just here because of some ad or the algorithm - no worries: ReactJS is a key technology as a web developer and in this course I will also explain WHY it's that important! Welcome to React - The Complete Guide! This course will teach you React.js in a practice-oriented way, using all the latest patterns and best practices you need. You will learn all the key fundamentals as well as advanced concepts and related topics to turn you into a React.js developer. This is a huge course because it really covers EVERYTHING you need to know and learn to become a React.js developer! No matter if you know nothing about React or if you already got some basic React knowledge (not required but also not a problem), you will get tons of useful information and knowledge out of this course! My goal with this course is to ensure that you feel confident working with React, so that you can apply for React jobs, use it in your own projects or simply enhance your portfolio as a developer - whatever your goal is: This course gets you there! I originally created this course in 2017 and I have kept it updated since that - redoing it from the ground up in 2021. And of course I'm dedicated to keeping this course up-to-date - so that you can rely on this course to learn React in the best possible way! What's in this course? A thorough introduction to React.js (What is it and why would you use it?) All the core basics: How React works, building components with React & building UIs with React Components, props & dynamic data binding Working with user events and state to create interactive applications A (thorough) look behind the scenes to understand how React works under the hood Detailed explanations on how to work with lists and conditional content React Hooks (in-depth)! Working with built-in Hooks and building custom Hooks How to debug React apps Styling React apps with Styled Components and CSS Modules Working with Fragments & Portals Dealing with side effects Class-based components and functional components Sending Http requests & handling transitional states + responses Handling forms and user input (incl. validation) Redux & Redux Toolkit Routing with React Router An in-depth introduction into Next.js Deploying React Apps Implementing Authentication Unit Tests Combining React with TypeScript Adding Animations Tons of examples and demo projects so that you can apply all the things you learned in real projects And so much more - check out the full curriculum on this page! This really is the Complete Guide - promised! And best of all? You don't need any prior React knowledge! This course starts with zero knowledge assumed! All you need is basic web development and JavaScript knowledge (though the course even includes a brief JavaScript refresher to ensure that we're all on the same page!). Check out the full curriculum, the free preview videos and join the course risk-free thanks to the 30-day money-back guarantee!"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6d",
    "rating": {
      "number": 5.0,
      "badge": "Excellent"
    },
    "total_view": "785,688",
    "students": "339,210",
    "title": "MongoDB - The Complete Developer's Guide 2022",
    "author": {
      "name": "Rakibul Islam",
      "published_date": "2022-10-24 17:27:34",
      "img": "https://i.postimg.cc/CYnrm0Ly/rakib.jpg"
    },
    "thumbnail_url": "https://i.postimg.cc/RCHDk4C6/mongodb.jpg",
    "image_url": "https://i.postimg.cc/RCHDk4C6/mongodb.jpg",
    "details": "MongoDB is one of the most important NoSQL databases you can work with these days. It's extremely popular and MongoDB developers are in high demand. No matter if you're building web applications, mobile applications or any other kind of application or if you're a data scientist - you'll need to work with data. Storing data, querying it efficiently and minimizing complexities whilst optimizing performance are crucial tasks. MongoDB makes working with data simple - it's built on a philosophy that prioritizes performance and efficiency. In this course, you'll learn all about MongoDB from scratch. No prior MongoDB or database experience is required! In detail, you'll learn: ... how to install and use MongoDB locally and in the cloud (MongoDB Atlas) ... how to perform CRUD (Create, Read, Update, Delete) operations on MongoDB databases ... how to filter for data efficiently ... how to work with both the Mongo Shell and drivers (e.g. Node.js driver) ... how to increase performance by using indexes (and how to use the right indexes!) ... how to use the amazing Aggregation Framework that's built into MongoDB ... what replica sets and sharding are ... how to use MongoDB Atlas - the cloud solution offered by MongoDB ... how to use the serverless platform (Stitch) offered by MongoDB ... and much more! This course is a hands-on course - you'll learn by writing code/ commands. We'll work on a wide variety of example data and use-cases and by the end of the course, you'll have all the knowledge you need to work with MongoDB in your next project! This course is for you, no matter which programming language you plan on using, you'll learn a uniform way of interacting with MongoDB that can be easily applied to any language. This course is for you: ... if you're brand-new to MongoDB and databases in general ... if you got some basic database or even MongoDB experience - in this course, there are different entry points you can choose from! ... if you are a web or mobile app (or desktop app) developer who considers using MongoDB ... if you're working in a team that considers using MongoDB (or already does use it) ... if you are primarily using SQL-based databases so far and you want to explore the most popular NoSQL alternative This course is NOT for you: ... if you're looking for a guide on administrating MongoDB servers => This course focuses on the commands/ queries you write, it's NOT an administration course. I will show (in detail) how to deploy a ready-to-use cloud MongoDB solution that follows best practices though."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6e",
    "rating": {
      "number": 5.0,
      "badge": "Excellent"
    },
    "total_view": "785,688",
    "students": "339,210",
    "title": "Just Express (with a bunch of node and http) In detail",
    "author": {
      "name": "Rakibul Islam",
      "published_date": "2022-10-24 17:27:34",
      "img": "https://i.postimg.cc/CYnrm0Ly/rakib.jpg"
    },
    "thumbnail_url": "https://i.postimg.cc/bwzVSnxk/expressjs.png",
    "image_url": "https://i.postimg.cc/bwzVSnxk/expressjs.png",
    "details": "One of the first things you're going to learn in any node course is about the Express module. But how much do you really learn about it? How to render a page in one template engine? How to make a get and a post route? Most MEAN and MERN stacks students I've met learned Express in a few breaths and then moved on to MongoDB, MySQL, Angular, React, or whatever was in the rest of the tech stack. What is http anyway? Should I even care? It's easy to get 2 inches deep and find you've accomplished your task, but in fact have no idea why it works or how you'd go further. That, in my opinion, is no good for someone who wants to be a great developer. I've had a lot of students ask for a course on just Express js because they were either overwhelmed when they learned it, or they can't find any detail on it to go further than beginner knowledge. That's what this course is for. We will go through the various pieces of Express in detail so you can know why it behaves the way it does and get the most out of it. Express 5 is currently in alpha, so when it hits beta or full release, and as questions come up, the course will expand accordingly! Note: this course is not a quick path to launch a webapp with Express/Node. You can get that in 10 minutes in many other places. This course is meant to take a longer, deeper look at what Express js actually does. I've been using Express since V.2, in 2012 and have seen it do just about everything. It is one of my favorite node modules and consistently one of the most downloaded on npm. There are other awesome technologies that patch into Express that get easily missed. This course will naturally lead into other things like websockets, webRTC, etc. Prepare for one of the most awesome node modules on npm! Sections: Environment Setup (skip if you have node installed already) Before Express... - TCP & HTTP, making an express-less node server Express 101 - Making a basic web sever with Express Express 201 - Middleware and Rendering Express 301 - Req & Res revisited, the router, and the express generator Rendering Project API Project Passport (jwt & local strategy still coming) Best Practices (Coming...) Supplemental - connecting to various DBs (very basic - only for those already familiar with a database) Who this course is for: Beginner node developers who want to learn Express but overwhelmed by full MERN or MEAN courses Beginner node developers who need a review of JUST Express js Developers who want to go into the various pieces of Express in a little more depth without having to look at the docs Developers interested in using node as a webserver or using web sockets with Express"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6f",
    "rating": {
      "number": 5.0,
      "badge": "Excellent"
    },
    "total_view": "785,688",
    "students": "339,210",
    "title": "Complete Next.js Developer in 2022: Zero to Mastery",
    "author": {
      "name": "Rakibul Islam",
      "published_date": "2022-10-24 17:27:34",
      "img": "https://i.postimg.cc/CYnrm0Ly/rakib.jpg"
    },
    "thumbnail_url": "https://i.postimg.cc/sDCNyq1n/nextjs.png",
    "image_url": "https://i.postimg.cc/sDCNyq1n/nextjs.png",
    "details": "Using the latest version of Next.js, this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies for a reason. We guarantee you this is the most comprehensive online resource on Next.js and React. This project based course will introduce you to all of the modern toolchain of a Next.js developer in 2022. Along the way, we will build a massive Netflix Clone application using React Hooks, Hasura (GraphQL), Context API, Airtable, Serverless Functions, Framer Motion, Vercel + more. This is going to be a full stack app unlike what you see in most easy tutorials online! The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional Next.js project all the way into production. We will start from the very beginning by teaching you Next.js fundamentals, and then going into advanced topics so you can make good decisions on architecture and tools on any of your future NextJS projects. All code is going to be provided step by step, and even if you don’t like to code along, you will get access to the the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away. This is what the course will cover: 1. Next.js Fundamentals Comparing Next.js with React, and learning about the benefits that Next.js offers. You will understand why Next.js has gained so much popularity and what JAM Stack is all about. This section will build the foundation you need for the rest of the course. 2. Build your first Next.js app | Coffee Connoisseur We will be building the first project right away. This 1st one mainly teaches the fundamentals of Next.js. This section focuses on setting up the project, teaching fundamentals such as css modules, fast refresh, how the project is setup, etc... 3. Routing with Next.js | Coffee Connoisseur You will learn everything about routing such as dynamic routes, index routes, named routes, Link component. 4. Styling in Next.js | Coffee Connoisseur This section will teach you how to style your applications using css modules, separate components styles, and global styles. 5. Hydration, SEO and Different Rendering Techniques in Next.js This is one of the most important section of the course. The section will teach you about what SEO is, how Next.js helps with SEO, what the different rendering techniques are such as: static site generation, server side rendering, incremental static regeneration (and how they are different), client side rendering, and what is hydration. 6. Static Coffee Store Pages | Coffee Connoisseur Students will learn about static rendering in detail and how to choose what to statically render. You will make API requests to Foursquare and rendering those using SSG. 7. Coffee stores by Location | Coffee Connoisseur Next.js allows you to use different fallbacks when you choose to statically render. This section will talk about that in depth and you will also learn how to retrieve users location and use the Context API. 8. Serverless functions | Coffee Connoisseur What are serverless functions? Why do we use them and when? You will be creating serverless functions for retrieving static coffee stores. 9. Store Coffee Store using Airtable | Coffee Connoisseur You will learn about database storage using Airtable. We will be storing the coffee store data in Airtable and will learn client side rendering here. 10. SWR with Client Side Rendering | Coffee Connoisseur What is SWR? When to use it? We will be using the Next.js library for SWR, and using SWR and client side rendering in this section. 11. Deployment and Build Optimization | Coffee Connoisseur Deploy your app to Vercel as well as Netlify. You will learn what the different cloud providers are and how Vercel is different, what is Lighthouse, and how to improve our performance in Next.js. 12. Project Setup | Netflix with Next.js This is a big one! You will start to set up for the final project. This section is about setting up our Netflix project. 13. Netflix Home Page and Video | Netflix with Next.js You will build the home page and use server side rendering. You will learn how to server render content, and we will also invoke the YouTube API to get a list of videos and display on the home page. Card component is complex in Netflix so you will also learn some framer motion to build the card component. 14. Authentication with Magic | Netflix with Next.js How does Auth works in Next.js? We will be using passwordless login in Next and build the login page with proper authentication and validation. 15. Incremental Static Regeneration | Netflix with Next.js Display the videos on the home page and use ISR to build the modal as a page. You will learn more about incremental static generation to build this modal. 16. Hasura GraphQL | Netflix with Next.js You will learn what is GraphQL, Hasura, and how Hasura architecture looks like. We will be setting up the project with the Hasura environment. 17. Authentication with Hasura | Netflix with Next.js You will learn how auth flow architecture works, and introduce server side SDK to log the user in. 18. Ratings service and Favourited Videos Page | Netflix with Next.js You will setup Hasura for ratings service, create ratings API to like and dislike videos, and build the my list page to show a list of favourited YouTube videos. 19.  Deploying to Production | Netflix with Next.js Create the final GitHub repo, setup the repo, and finally deploy to Vercel! 20. Appendix: Introduction to React An optional section for those that need a primer on React.js and React Hooks to get you ready to fully get the most out of this course. ------------ We guarantee you this is the best course out there on Next.js. This course is not about making you just code along without understanding the principles so that when you are done with the course you don’t know what to do other than watch another tutorial. No! This course will push you and challenge you to go from an absolute beginner in Next.js to someone that is in the top 10% of Next.js and React developers. We guarantee it. See you inside the course!"
  }
]
